#Задание 1
a, b = map(float, input().split())
if b != 0:
	print(a/b)
else:
	print('Нельзя делить на ноль')
